StreetCanyon-APFoam/0.orig/C2H6
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object       C2H6;
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
 
dimensions      [0 0 0 0 0 0 0]; 
 
 
internalField   uniform  0;
 
boundaryField 
{ 

    inlet
    {
        type            fixedValue; 
        value           $internalField;
    }
    
    outlet
    {
        type            inletOutlet; 
        inletValue      $internalField;
        value           $internalField;
    }
    
    topWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
	type            empty;
    }
    
    building
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
