StreetCanyon-APFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

z0 0;
z1 0.05;

x0 0;
x1 10;
x2 30.51;
x3 40.51;

y0 0;
y1 25.78;
y2 26.92;
y3 36.92;

vertices
(

//Behind

    ( $x1 $y0 $z0 )
    ( $x2 $y0 $z0 )
    
    ( $x1 $y1 $z0 )
    ( $x2 $y1 $z0 )
    ( $x3 $y1 $z0 )
    
    ( $x0 $y2 $z0 )
    ( $x1 $y2 $z0 )
    ( $x2 $y2 $z0 )
    ( $x3 $y2 $z0 )
    
    ( $x0 $y3 $z0 )
    ( $x1 $y3 $z0 )
    ( $x2 $y3 $z0 )
    ( $x3 $y3 $z0 )
    
//Front

    ( $x1 $y0 $z1 )
    ( $x2 $y0 $z1 )
    
    ( $x1 $y1 $z1 )
    ( $x2 $y1 $z1 )
    ( $x3 $y1 $z1 )
    
    ( $x0 $y2 $z1 )
    ( $x1 $y2 $z1 )
    ( $x2 $y2 $z1 )
    ( $x3 $y2 $z1 )
    
    ( $x0 $y3 $z1 )
    ( $x1 $y3 $z1 )
    ( $x2 $y3 $z1 )
    ( $x3 $y3 $z1 )
      
);

blocks
(
    hex ( 0  1  3  2 13 14 16 15 ) ( 42 52  1 ) simpleGrading ( 1 1 1 )
    hex ( 2  3  7  6 15 16 20 19 ) ( 42  2  1 ) simpleGrading ( 1 1 1 )
    hex ( 3  4  8  7 16 17 21 20 ) ( 20  2  1 ) simpleGrading ( 1 1 1 )
    hex ( 5  6 10  9 18 19 23 22 ) ( 20 20  1 ) simpleGrading ( 1 1 1 )
    hex ( 6  7 11 10 19 20 24 23 ) ( 42 20  1 ) simpleGrading ( 1 1 1 )
    hex ( 7  8 12 11 20 21 25 24 ) ( 20 20  1 ) simpleGrading ( 1 1 1 )
    
);

edges
(
);

boundary
(
	
    inlet
    {
        type patch;
        faces
        (
            ( 5 18 22  9 )
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            ( 4  8 21 17 )
            ( 8 12 25 21 )
        );
    }
    
    topWall
    {
        type wall;
        faces
        (
            (  9 22 23 10 )
            ( 10 23 24 11 )
            ( 11 24 25 12 )
        );
    }
    
    building
    {
        type wall;
        faces
        (
            ( 5  6 19 18 )
            ( 0 13 15  2 )
            ( 2 15 19  6 )
            ( 0  1 14 13 )
            ( 1  3 16 14 )
            ( 3  4 17 16 )
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (  0  2  3  1 )
            (  2  6  7  3 )
            (  3  7  8  4 )
            (  5  9 10  6 )
            (  6 10 11  7 )
            (  7 11 12  8 )
            ( 13 14 16 15 )
            ( 15 16 20 19 )
            ( 16 17 21 20 )
            ( 18 19 23 22 )
            ( 19 20 24 23 )
            ( 20 21 25 24 )
	);

     }
);
// ************************************************************************* //
