StreetCanyon-APFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;//steadyState;//Euler;
}

gradSchemes
{
    default         Gauss linear;

    /*grad(p)         cellMDLimited leastSquares 0.5;
    grad(U)         cellMDLimited leastSquares 0.5;
    grad(k)         cellMDLimited leastSquares 0.5;
    grad(epsilon)     cellMDLimited leastSquares 0.5;*/
}

divSchemes
{
    default         none;

    div(phi,U)       bounded Gauss linearUpwind limited;
    div(phi,k)       bounded Gauss limitedLinear 1;//Gauss upwind;
    div(phi,epsilon) bounded Gauss limitedLinear 1;
    div(phi,h)       bounded Gauss limitedLinear 1;
    div(phi,K)       bounded Gauss limitedLinear 1;
    div(phid,p)      bounded Gauss limitedLinear 1;
    div(phi,Yi)      Gauss limitedLinear01 1;
    div(phi,Yi_h)    Gauss limitedLinear01 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
